function searchHero() {
  var hayheros = document.getElementById("search-box").value;
  var x;
switch (hayheros) {
  case "Գարեգին Նժդեհ":
    x = "<b>Գարեգին Նժդեհ կամ Գարեգին Առաքել Եղիշեի Տեր-Հարությունյան</b> <br> <b>Ծնվել է՝</b> հունվարի 1, 1886թ․, մահացել՝ դեկտեմբերի 21, 1955թ․։ <br> <b>Ծննդավայր</b> - Նախիջևան, գողթան գավառ <br><b>Մահվան վայր</b> - ԽՍՀՄ, բանտ <br> <b> Կոչում</b> - սպարապետ <br> <b> Մարտեր/Պատերազմներ </b><br> Բալկանյան պատերազմ, 1912 թ.<br> Առաջին համաշխարհային պատերազմի ռուս-թուրքական ռազմաճակատ<br> Արևմտահայաստանի ազատագրման ռազմագործողություններ՝ 1914-1917 թթ.<br> Անիի ճակատամարտ<br> Ղարաքիլիսայի ճակատամարտ<br> Լեռնահայաստանի պաշտպանություն, 1921 թ.";
    break;
  case "Լեոնիդ Ազգալդյան":
    x = "<b>Լեոնիդ Ռուբենի Ազգալդյան</b> <br><b>Ծնվել է՝</b> նոյեմբերի 22, 1942թ, մահացել՝ հունիսի 21, 1992թ: <br><b> Ծննդավայր</b> - Թբիլիսի, Վրացական ԽՍՀ, ԽՍՀՄ <br><b>Մահվան վայր</b> - Տոնաշեն, Մարտակերտի շրջան, Արցախ<br><b>Մասնագիտություն</b> - ֆիզիկոս և զինվոր <br> <b>Մարտեր/Պատերազմներ</b> <br>Արցախյան ազատամարտ";
    break;
  case "Հովհաննես Բաղրամյան":
    x = "<b>Հովhանnես Խաչատուրի Բաղրամյան կամ Իվան Քրիստափորի Բաղրամյան</b><br><b>Ծնվել է՝</b> դեկտեմբերի 2, 1897թ, մահացել՝ սեպտեմբերի 21, 1982թ:<br><b>Ծննդավայր</b> - Գ. Չարդախլու, Գանձակ <br><b>Մահվան վայր</b> - Մոսկվա, Ռուսաստան <br> <b>Կոչում </b>- ԽՍՀՄ Մարշալ<br><b>Մարտեր/Պատերազմներ</b><br>Սարդարապատի ճակատամարտ 1918 թ.<br>Երկրորդ Համաշխարհային Պատերազմ 1939 թ.";
    break;
  case "Մոնթե Մելքոնյան":
    x = "<b>Մոնթե Մելքոնյան</b><br><b>Ծնվել է՝</b> նոյեմբերի 25, 1957թ, մահացել՝ հունիսի 12, 1993թ:<br><b>Ծննդավայր</b> - Վիսեյլիա, Կալիֆոռնիա, ԱՄՆ<br><b>Մահվան վայր</b> - Արցախ Մարզիլի գյուղ, Մարտունու շրջան, Արցախ<br><b>Զորատեսակ</b> - Արցախի պաշտպանության բանակ<br> <b>Կոչում</b> - փոխգնդապետ <br><b>Մարտեր/Պատերազմներ</b><br>Լիբանանի Քաղաքացիական պատերազմ<br>Արցախյան ազատամարտ<br>Վան ռազմագործողություն";
    break;
  case "Հովհաննես Իսակով":
    x = "<b>Հովհաննես (Իվան) Ստեփանի Իսակով</b><br><b>Ծնվել է՝</b> օգոստոսի 22, 1894թ, մահացել՝ հոկտեմբերի 11, 1967թ<br><b>Ծննդավայր</b> -  Հաջիշեն, Ելիզավետպոլի գավառ, Ելիզավետպոլի նահանգ, Ռուսական կայսրություն<br><b>Մահվան վայր</b> - Մոսկվա, ԽՍՀՄ<br><b>Զորատեսակ</b> - հետևազոր և հրետանի<br><b>Կոչում</b> - Խորհրդային միության նավատորմի ծովակալ<br><b>Մարտեր/պատերազմներ</b><br>Առաջին համաշխարհային պատերազմ<br>Ռուսաստանի քաղաքացիական պատերազմ<br>Հայրենական մեծ պատերազմ <br>Խորհրդա-ֆիննական պատերազմ";
    break;
  case "Համազասպ Բաբաջանյան":
    x = "<b>Համազասպ Խաչատուրի Բաբաջանյան</b><br><b>Ծնվել է՝</b> փետրվարի 18, 1906թ, մահացել՝ Նոյեմբերի 1, 1977թ:<br><b>Ծննդավայր</b> - գ. Գանձակ<br><b>Մահվան վայր</b> - Մոսկվա, Ռուսաստան<br><b>Զորատեսակ</b> - Հետևազոր, ԽՍՀՄ<br><b>Կոչում</b> - մարշալ<br><b>Մարտեր/Պատերազմներ</b><br>Խորհրդա-ֆիննական պատերազմ<br>Երկրորդ համաշխարհային պատերազմ";
    break;
  case "Անդրանիկ Օզանյան":
    x = "<b>Անդրանիկ Թորոսի Օզանյան, Զորավար Անդրանիկ կամ Անդրանիկ Փաշա</b><br><b>Ծնվել է՝</b> փետրվարի 25, 1865թ, մահացել՝ օգոստոսի 31, 1927թ:<br><b>Ծննդավայր</b> - Շապին Գարահիսար, Արևմտյան Հայաստան<br><b>Մահվան վայր</b> -  Ռիչարդսոն Սփրինգս, Կալիֆոռնիա, ԱՄՆ<br><b>Կոչում</b> - Գեներալ մայոր<br><b>Մարտեր/Պատերազմներ</b>Բալկանյան Առաջին պատերազմ<br>Առաջին համաշխարհային պատերազմ"
    break;
  case "Դրաստամատ Կանայան":
    x = "<b>Դրաստամատ Մարտիրոսի Կանայան</b><br><b>Ծնվել է՝</b> մայիսի 1(13) 1883թ, մահացել՝ մարտի 8, 1956թ:<br><b>Ծննդավայր</b> - Իգդիր, Երևանի նահանգ, Ռուսական կայսրություն<br><b>Մահվան վայր</b> - Բոստոն, ԱՄՆ<br><b> Կուսակցություն</b> - ՀՅԴ<br><b>Մասնագիտություն</b> - ռազմական գործիչ, քաղաքական գործիչ և հեղափոխական"
    break;
  case "Ջիվան Աբրահամյան":
    x = "<b>Ջիվան Զավենի Աբրահամյան</b><br><b>Ծնվել է՝</b> հուլիսի 6, 1961թ, մահացել՝ հուլիսի 20, 1991թ:<br><b>Ծննդավայր</b> - Երևան, Հայաստան<br><b>Մահվան վայր</b> - Վերինշեն գյուղ, Շահումյան Արցախ<br><b>Զորատեսակ</b> - Հատուկ նշանակության զորքեր<br><b>Կոչում</b> - կապիտան<br><b>Մարտեր/Պատերազմներ</b><br>Աֆղանական պատերազմ (1979—1989)<br>Հայ-ադրբեջանական պատերազմ (1991-1994)<br>Արցախյան ազատամարտ";
    break;
  case "Արկադի Տեր-Թադևոսյան":
    x = "<b>Արկադի Հովհաննեսի Տեր-Թադևոսյան (Կոմանդոս)</b><br><b>Ծնվել է՝</b> մայիսի 22, 1939թ, մարտի 31, 2021թ:<br><b>Ծննդավայր</b> - Թբիլիսի, Վրացական ԽՍՀ, ԽՍՀՄ<br><b>Մահվան վայր</b> - Երևան, Հայաստան<br><b>Զորատեսակ</b> - Արցախի պաշտպանության բանակ և Խորհրդային բանակ<br><b>Կոչում</b> - գեներալ մայոր<br><b>Մարտեր/Պատերազմներ</b><br>Աֆղանական պատերազմ<br>Արցախյան ազատամարտ";
    break;
    case "Գուրգեն Դալիբալթայան":
    x = "<b>Գուրգեն Հարությունի Դալիբալթայան</b><br><b>Ծնվել է՝</b> հունիսի 5, 1926թ, մահացել՝ սեպտեմբերի 1, 2015թ:<br><b>Ծննդավայր</b> - Մեծ Արագյալ<br><b>Մահվան վայր</b> - Երևան, Հայաստան<br><b>Զորատեսակ</b> - Խորհրդային բանակ, ԽՍՀՄ ցամաքային զորքեր և Հայաստանի ցամաքային զորքեր<br><b>Կոչում</b> - գեներալ գնդապետ<br><b>Մարտեր/Պատերազմներ</b><br>Հայրենական մեծ պատերազմ<br>Արցախյան ազատամարտ";
    break;
  default:
    x = "Ձեր <<հերոսը>> չի գտնվել, ստուգեք ձեր գրածը և փորձեք գրել անուն ազգանունը մեծատառով։";

}
  document.getElementById("hero-info").innerHTML = x;
}